globalsdp/Tests/claro/v1/partner/mms_notification.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.3" jmeter="2.8.20130705">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Global SDP - MMS MT Notification" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1442878578000</longProp>
        <longProp name="ThreadGroup.end_time">1442878578000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable" enabled="true">
          <stringProp name="variableName">TRANSACTION_ID</stringProp>
          <stringProp name="outputFormat">000000000</stringProp>
          <stringProp name="minimumValue">000000000</stringProp>
          <stringProp name="maximumValue">999999999</stringProp>
          <boolProp name="perThread">false</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">application/xml</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;mse-response&gt;&#xd;
           &lt;status-code&gt;0&lt;/status-code&gt;&#xd;
           &lt;profile&gt;profleID&lt;/profile&gt;&#xd;
           &lt;transaction-id&gt;${TRANSACTION_ID}&lt;/transaction-id&gt;&#xd;
           &lt;parameters&gt;&#xd;
              &lt;param-item&gt;&#xd;
                 &lt;param-name&gt;CTN&lt;/param-name&gt;&#xd;
                 &lt;param-value&gt;1191000000&lt;/param-value&gt;&#xd;
              &lt;/param-item&gt;&#xd;
              &lt;param-item&gt;&#xd;
                 &lt;param-name&gt;MMS&lt;/param-name&gt;&#xd;
                 &lt;param-value&gt;&#xd;
                    Content-Type%3A+multipart%2Frelated%3B+%0Aboundary%3D%22----&#xd;
                    %3D_Part_293_32260093.1084542774606%22%0ASubject%3A+mms+example%0A%0A------&#xd;
                    %3D_Part_293_32260093.1084542774606%0AContent-ID%3A+%3Ctext0.txt%3E%0AContent-&#xd;
                    Type%3A+text%2Fplain%3B+charset%3DUTF-8%0A%0Atext+content+sample%0A------&#xd;
                    %3D_Part_293_32260093.1084542774606%0AContent-Transfer-&#xd;
                    Encoding%3A+binary%0AContent-&#xd;
                    Type%3A+image%2Fgif%0A%0AGIF89a%15%00%0E%00%A2%00%00%FF%FF%FF%FF%FFf%FF%CC%00%&#xd;
                    FF%993%CCf%00%00%99%CC%00%00%00%00%00%00%21%F9%04%01%00%00%07%00%2C%00%00%00%0&#xd;
                    0%15%00%0E%00%00%03Xx%BAgn%2CJ%27j%80r%B96z%BF%D8%24%5CC0VV%C8%18%83u%A2%A8%0A&#xd;
                    %28%ACi%B7%02Pa%F31%B3%A7%40%A0%050%E8%04%3C%1F%076%AC%1C%09%C9%1F%CC%82%8B%29&#xd;
                    f%C5%16%810%85%25%7D%AC%81%A3Z%E9%A8%94%0DLX%60%3Eg%1A%DB%01%F4%FD%7E%B8%23%09&#xd;
                    %00%3B%0A------%3D_Part_293_32260093.1084542774606--%0A%0A&#xd;
                &lt;/param-value&gt;&#xd;
              &lt;/param-item&gt;&#xd;
           &lt;/parameters&gt;&#xd;
        &lt;/mse-response&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">10.170.128.55</stringProp>
          <stringProp name="HTTPSampler.port">8888</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">claro/v1/notification/mms?pwd=d9b475e7dd35436e91e6ae65f7432c2f&amp;userId=567f6ee58c744dc0a39dc8987c9417cd</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>